#include<stdio.h>
void test(void)  //在（）内加入void
//如果在调用函数时传参会报错
{
	printf("haha");
}
int main()
{
	//int a = 10;
	//float b = 10.0;
	//if (a == b)
	//	printf("fat");
	//unsigned int c;
	//signed long d;
	//test(100);
	int a = 20;
	//00000000000000000000000000010100原码
	//00000000000000000000000000010100反码
	//00000000000000000000000000010100补码
	//转16进制 0x00000014
	int b = -10;
	//10000000000000000000000000001010原码
	//11111111111111111111111111110101反码
	//11111111111111111111111111110110补码
	//转16进制 0xFFFFFFF6
	return 0;
}